seanmccully/Remora/Firmware/FirmwareSource/Remora-OS6/TARGET_OCTOPUS_446/PeripheralPins.c
// Enable Pins (Active Low)
MBED_WEAK const PinMap PinMap_STEPPER_ENABLE[] = {
    {PF_14,      PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_PULLUP, 0)},  // !DRIVER0_EN (X)
    {PF_15,      PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_PULLUP, 0)},  // !DRIVER1_EN (Y)
    {PG_5,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_PULLUP, 0)},  // !DRIVER2_EN (Z)
    {PA_0,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_PULLUP, 0)},  // !DRIVER3_EN (E0)
    {PG_2,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_PULLUP, 0)},  // !DRIVER4_EN (E1)
    {PF_1,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_PULLUP, 0)},  // !DRIVER5_EN (E2)
    {PD_4,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_PULLUP, 0)},  // !DRIVER6_EN (E3)
    {PE_0,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_PULLUP, 0)},  // !DRIVER7_EN (E4)
    {NC, NC, 0}
};

//*** Endstops and Probe ***

MBED_WEAK const PinMap PinMap_ENDSTOPS[] = {
    // Main axis endstops
    {PG_6,       PIN_INPUT, STM_PIN_DATA(STM_MODE_INPUT, GPIO_PULLUP, 0)},  // X_MIN
    {PG_9,       PIN_INPUT, STM_PIN_DATA(STM_MODE_INPUT, GPIO_PULLUP, 0)},  // X_MAX
    {PG_10,      PIN_INPUT, STM_PIN_DATA(STM_MODE_INPUT, GPIO_PULLUP, 0)},  // Y_MIN
    {PG_11,      PIN_INPUT, STM_PIN_DATA(STM_MODE_INPUT, GPIO_PULLUP, 0)},  // Y_MAX
    {PG_12,      PIN_INPUT, STM_PIN_DATA(STM_MODE_INPUT, GPIO_PULLUP, 0)},  // Z_MIN
    {PG_13,      PIN_INPUT, STM_PIN_DATA(STM_MODE_INPUT, GPIO_PULLUP, 0)},  // Z_MAX
    // Extra endstops
    {PG_14,      PIN_INPUT, STM_PIN_DATA(STM_MODE_INPUT, GPIO_PULLUP, 0)},  // E_MIN
    {PG_15,      PIN_INPUT, STM_PIN_DATA(STM_MODE_INPUT, GPIO_PULLUP, 0)},  // E_MAX
    {NC, NC, 0}
};

// Probe Pins (BLTouch)
MBED_WEAK const PinMap PinMap_PROBE[] = {
    {PB_6,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4)},  // PROBE_PWM (Servo)
    {PB_7,       PIN_INPUT,  STM_PIN_DATA(STM_MODE_INPUT, GPIO_PULLUP, 0)},              // PROBE_SENSE
    {PC_5,       PIN_INPUT,  STM_PIN_DATA(STM_MODE_INPUT, GPIO_PULLUP, 0)},              // PROBE_IN (Z-Probe)
		{PC_0,      PIN_INPUT, STM_PIN_DATA(STM_MODE_INPUT, GPIO_PULLUP, 0)}, // PWR DET
    {NC, NC, 0}
};

//*** Temperature Control ***

// Heaters (PWM)
MBED_WEAK const PinMap PinMap_HEATER[] = {
    {PA_1,       PWM_2,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2, 2, 0)}, // HB (Heated Bed)
    {PA_2,       PWM_2,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2, 3, 0)}, // HE0 (Hotend 0)
    {PA_3,       PWM_2,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2, 4, 0)}, // HE1 (Hotend 1)
    {PB_10,      PWM_2,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2, 5, 0)}, // HE2 (Hotend 2)
    {PB_11,      PWM_2,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM2, 6, 0)}, // HE3 (Hotend 3)
    {NC, NC, 0}
};

// Fans (PWM)
MBED_WEAK const PinMap PinMap_FAN[] = {
    {PA_8,       PWM_1,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF1_TIM1, 1, 0)}, // FAN0
    {PE_5,       PWM_9,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF3_TIM9, 1, 0)}, // FAN1
    {PD_12,      PWM_4,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4, 1, 0)}, // FAN2
    {PD_13,      PWM_4,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4, 2, 0)}, // FAN3
    {PD_14,      PWM_4,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4, 3, 0)}, // FAN4
    {PD_15,      PWM_4,  STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM4, 4, 0)}, // FAN5
    {NC, NC, 0}
};

// Thermistors (ADC)
MBED_WEAK const PinMap PinMap_TEMP[] = {
    {PF_3,       ADC_3, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 9, 0)},   // THERM0
    {PF_4,       ADC_3, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 14, 0)},  // THERM1
    {PF_5,       ADC_3, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 15, 0)},  // THERM2
    {PF_6,       ADC_3, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 4, 0)},   // THERM3
    {PF_7,       ADC_3, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 5, 0)},   // THERM4
    {NC, NC, 0}
};

//*** User Interface ***


//*** SDIO Interface ***

MBED_WEAK const PinMap PinMap_SD[] = {
    {PC_8,       SDIO_BASE, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF12_SDIO)},  // SDIO_D0
    {PC_9,       SDIO_BASE, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF12_SDIO)},  // SDIO_D1
    {PC_10,      SDIO_BASE, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF12_SDIO)},  // SDIO_D2
    {PC_11,      SDIO_BASE, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF12_SDIO)},  // SDIO_D3
    {PC_12,      SDIO_BASE, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF12_SDIO)},  // SDIO_CK
    {PD_2,       SDIO_BASE, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF12_SDIO)},  // SDIO_CMD
    {NC, NC, 0}
};

// LCD Control
MBED_WEAK const PinMap PinMap_LCD[] = {
    {PE_9,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_NOPULL, 0)},  // LCD_EN
    {PE_10,      PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_NOPULL, 0)},  // LCD_RS
    {PE_12,      PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_NOPULL, 0)},  // LCD_D4
    {PE_13,      PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_NOPULL, 0)},  // LCD_D5
    {PE_14,      PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_NOPULL, 0)},  // LCD_D6
    {PE_15,      PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_NOPULL, 0)},  // LCD_D7
    {NC, NC, 0}
};

// UI Controls
MBED_WEAK const PinMap PinMap_UI[] = {
    {PE_7,       PIN_INPUT,  STM_PIN_DATA(STM_MODE_INPUT, GPIO_PULLUP, 0)},     // BTN_ENC
    {PB_1,       PIN_INPUT,  STM_PIN_DATA(STM_MODE_INPUT, GPIO_PULLUP, 0)},     // BTN_EN2
    {PB_2,       PIN_INPUT,  STM_PIN_DATA(STM_MODE_INPUT, GPIO_PULLUP, 0)},     // BTN_EN1
    {NC, NC, 0}
};

//*** Communication Interfaces ***

//*** SERIAL ***
MBED_WEAK const PinMap PinMap_UART_TX[] = {
    // Display UART
    {PD_8,       UART_3,  STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_USART3)}, // UART3_TX
    // UART2
    {PD_5,       UART_2,  STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_USART2)}, // UART2_TX (Host)
    
    // ESP UART
    {PA_9,       UART_1,  STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_USART1)}, // UART1_TX
 
    {NC, NC, 0}
};

MBED_WEAK const PinMap PinMap_UART_RX[] = {
    // Display UART
    {PD_9,       UART_3,  STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_USART3)}, // UART3_RX
	  // UART2
    {PD_6,       UART_2,  STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_USART2)}, // UART2_RX (Host)
   
    // ESP UART
    {PA_10,      UART_1,  STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_USART1)}, // UART1_RX

    {NC, NC, 0}
};

//*** CAN ***

MBED_WEAK const PinMap PinMap_CAN_RD[] = {
    {PD_0,       CAN_1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF9_CAN1)},
    {NC, NC, 0}
};

MBED_WEAK const PinMap PinMap_CAN_TD[] = {
    {PD_1,       CAN_1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF9_CAN1)},
    {NC, NC, 0}
};

//*** USB Device ***

MBED_WEAK const PinMap PinMap_USB_FS[] = {
    // USB Type-C Configuration
    {PA_11,     USB_FS, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_OTG_FS)}, // USB_DM
    {PA_12,     USB_FS, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF10_OTG_FS)}, // USB_DP
    {PA_9,      USB_FS, STM_PIN_DATA(STM_MODE_INPUT, GPIO_NOPULL, GPIO_AF_NONE)},     // VBUS detect
    // Remove {PA_10} since it's used for USART1_RX
    {NC, NC, 0}
};

#if (MBED_CONF_TARGET_USB_SPEED == USE_USB_HS_IN_FS)
MBED_WEAK const PinMap PinMap_USB_HS[] = {
    {PB_14,     USB_HS, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF12_OTG_HS_FS)}, // USB_HS_DM
    {PB_15,     USB_HS, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF12_OTG_HS_FS)}, // USB_HS_DP
    {NC, NC, 0}
};
#endif

//*** I2C ***

MBED_WEAK const PinMap PinMap_I2C_SDA[] = {
    {PB_9,       I2C_1, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C1)},
    {NC, NC, 0}
};

MBED_WEAK const PinMap PinMap_I2C_SCL[] = {
    {PB_8,       I2C_1, STM_PIN_DATA(STM_MODE_AF_OD, GPIO_NOPULL, GPIO_AF4_I2C1)},
    {NC, NC, 0}
};

