seanmccully/Remora/Firmware/FirmwareSource/Remora-OS6/TARGET_OCTOPUS_446/PeripheralPins.c
//*** System Clock Configuration ***

MBED_WEAK const PinMap PinMap_OSC[] = {
    {PC_14,      RCC_BASE, STM_PIN_DATA(STM_MODE_INPUT, GPIO_NOPULL, 0)},  // OSC32_IN
    {PC_15,      RCC_BASE, STM_PIN_DATA(STM_MODE_INPUT, GPIO_NOPULL, 0)},  // OSC32_OUT
    {NC, NC, 0}
};


// SPI1 (TMC Drivers)
MBED_WEAK const PinMap PinMap_SPI1[] = {
    {PA_7,       SPI_1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI1)},  // SPI1_MOSI
    {PA_6,       SPI_1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI1)},  // SPI1_MISO
    {PA_5,       SPI_1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI1)},  // SPI1_SCK
    {PA_4,       SPI_1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},  // SD_CS
    {NC, NC, 0}
};

// SPI2 (Aux)
MBED_WEAK const PinMap PinMap_SPI2[] = {
    {PC_3,       SPI_2, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI2)},  // SPI2_MOSI
    {PC_2,       SPI_2, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI2)},  // SPI2_MISO
    {PB_13,      SPI_2, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI2)},  // SPI2_SCK
    {PB_12,      SPI_2, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF5_SPI2)},  // SPI2_NSS
    {NC, NC, 0}
};

// SPI3 (Display)
MBED_WEAK const PinMap PinMap_SPI3[] = {
    {PB_5,       SPI_3, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF6_SPI3)},  // SPI3_MOSI
    {PB_4,       SPI_3, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF6_SPI3)},  // SPI3_MISO
    {PB_3,       SPI_3, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF6_SPI3)},  // SPI3_SCK
    {PA_15,      SPI_3, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_NOPULL, GPIO_AF6_SPI3)},  // SPI3_NSS
    {NC, NC, 0}
};

// ESP Communication
MBED_WEAK const PinMap PinMap_ESP[] = {
    {PD_7,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_USART2)},  // ESP TX
    {PD_10,      PIN_INPUT,  STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_USART2)},  // ESP RX
    {PG_7,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_NOPULL, 0)},            // ESP IO0
    {PG_8,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_NOPULL, 0)},            // ESP RESET
    {NC, NC, 0}
};

//*** System Control ***

// Power Control
MBED_WEAK const PinMap PinMap_POWER[] = {
    {PE_11,      PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_NOPULL, 0)},     // PS_ON
    {PB_0,       PWM_3,     STM_PIN_DATA_EXT(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF2_TIM3, 3, 0)}, // STATUS_LED
    {PA_13,      PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_NOPULL, 0)},     // WORK_LED
    {NC, NC, 0}
};

//*** Special Interfaces ***

// TMC Driver Communication (UART Mode)
MBED_WEAK const PinMap PinMap_TMC_UART[] = {
    {PC_4,       UART_1, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF8_UART4)},  // DRIVER0_CS/UART
    {PD_11,      UART_2, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_USART2)}, // DRIVER1_CS/UART
    {PC_6,       UART_3, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_USART3)}, // DRIVER2_CS/UART
    {PC_7,       UART_3, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_USART3)}, // DRIVER3_CS/UART
    {PF_2,       UART_2, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_USART2)}, // DRIVER4_CS/UART
    {PE_4,       UART_3, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_USART3)}, // DRIVER5_CS/UART
    {PE_1,       UART_3, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_USART3)}, // DRIVER6_CS/UART
    {PD_3,       UART_2, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF7_USART2)}, // DRIVER7_CS/UART
    {NC, NC, 0}
};

// TMC Driver Communication (SPI Mode)
MBED_WEAK const PinMap PinMap_TMC_SPI[] = {
    {PC_4,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},  // DRIVER0_CS
    {PD_11,      PIN_OUTPUT, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},  // DRIVER1_CS
    {PC_6,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},  // DRIVER2_CS
    {PC_7,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},  // DRIVER3_CS
    {PF_2,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},  // DRIVER4_CS
    {PE_4,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},  // DRIVER5_CS
    {PE_1,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},  // DRIVER6_CS
    {PD_3,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},  // DRIVER7_CS
    {NC, NC, 0}
};

// Temperature Sensor Interface (MAX31865)
MBED_WEAK const PinMap PinMap_MAX31865[] = {
    {PF_8,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF5_SPI1)},  // MAX31865_CS
    {NC, NC, 0}
};

//*** Debug Interface ***

MBED_WEAK const PinMap PinMap_DEBUG[] = {
    {PA_13,      DEBUG_JTMS_SWDIO, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SWJ)},    // SWDIO/WORK_LED
    {PA_14_ALT,  DEBUG_JTCK_SWCLK, STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SWJ)},    // SWCLK
    {PA_15_ALT,  DEBUG_JTDI,       STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SWJ)},    // JTDI/SPI3_NSS
    {PB_3_ALT,   DEBUG_JTDO_SWO,   STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SWJ)},    // SWO
    {PB_4_ALT,   DEBUG_JTRST,      STM_PIN_DATA(STM_MODE_AF_PP, GPIO_PULLUP, GPIO_AF0_SWJ)},    // JTRST
    {NC, NC, 0}
};

//*** Sound Output ***

MBED_WEAK const PinMap PinMap_BEEPER[] = {
    {PE_8,       PIN_OUTPUT, STM_PIN_DATA(STM_MODE_OUTPUT_PP, GPIO_NOPULL, 0)},  // BEEPER
    {NC, NC, 0}
};


